Autodesk.Revit.DB.HomeCamera.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.HomeCamera.ViewId
The id of the view which is associated to this document's Home view orientation.
Remarks:
A view can be associated to the document's Home view orientation by the View Cube menu option "Set Current View as Home".
Only one view is associated to the Home view orientation at any given time in the document.
Since:
2016

Autodesk.Revit.DB.HomeCamera.OrthogonalProjectionHeight
The height of orthogonal projection view volume.
Since:
2016

Autodesk.Revit.DB.HomeCamera.OrthogonalProjectionWidth
The width of orthogonal projection view volume.
Since:
2016

Autodesk.Revit.DB.HomeCamera.BottomAngleOfFieldOfView
The bottom angle of the field of view.
Since:
2016

Autodesk.Revit.DB.HomeCamera.TopAngleOfFieldOfView
The top angle of the field of view.
Since:
2016

Autodesk.Revit.DB.HomeCamera.RightAngleOfFieldOfView
The right angle of the field of view.
Since:
2016

Autodesk.Revit.DB.HomeCamera.LeftAngleOfFieldOfView
The left angle of the field of view.
Since:
2016

Autodesk.Revit.DB.HomeCamera.Pivot
The pivot point.
Since:
2016

Autodesk.Revit.DB.HomeCamera.UpDirection
The up direction vector.
Since:
2016

Autodesk.Revit.DB.HomeCamera.Center
The zoom or orbit center.
Since:
2016

Autodesk.Revit.DB.HomeCamera.EyePosition
The eye position point.
Since:
2016

Autodesk.Revit.DB.HomeCamera.#ctor(Autodesk.Revit.DB.HomeCamera)
Constructs a new copy of the input HomeCamera object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.HomeCamera
A structure that contains information about the camera and view for the Home view orientation stored in the model.
Since:
2016